app/Services/Transaction/PersonalAccount/SaldoService.php

    public function getByUser(User $user)
    {
        $personalAccount = PersonalAccount::firstWhere('user_id', $user->id);
---
select * from `personal_accounts` where `user_id` = 2 limit 1