app/Services/Transaction/TransactionService.php

select * from `transactions` where `user_id` = 2 order by `transaction_date` desc
select * from `personas` order by `common_name` asc
select * from `categories` where `categories`.`id` in (1)
---
    public function getIndexData(Filter $filter, User $user): array
    {
        $transactions = Transaction::applyFilter($filter)
            ->whereUser($user)
            ->orderBy('transaction_date', 'desc')
            ->with('category')
            ->limit(1000)
            ->get();

        $filterableColumns = Transaction::getFilterableColumns();
        $personas = Persona::orderBy('common_name')->get();