app/Services/Transaction/TransactionQuerySet.php

select * from `categories` where `categories`.`id` in (1)
---
    public function getTenLatestTransactionsByUserForHomePage(User $user): Collection
    {
        return Transaction::with('category')
            ->baseCalculationQuery()
            ->whereUser($user)
            ->orderByTransactionDate()
            ->limit(10)
            ->get();