app/Services/Transaction/Budget/DefaultBudgetService.php

select * from `budgets` where `budgets`.`user_id` = 2 and `budgets`.`user_id` is not null order by `created_at` desc
select * from `personal_accounts` where `personal_accounts`.`user_id` = 2 and `personal_accounts`.`user_id` is not null order by `created_at` desc
---
    public function getOrCreateBudgetsForUser(User $user): Collection
    {
        $usersBudgets = $user // @todo - move to service
            ->budgets()
            ->latest()
            ->get();

        if ($usersBudgets->count() > 0) {
            return $usersBudgets;
        }

        $usersMoneySum = $user // @todo - move to service, should sum taking currency into account
            ->personalAccounts()
            ->latest()
            ->get()
            ->sum('value');

insert into `budgets` (`amount`, `name`, `type`, `user_id`) values (2500, 'general budget', 0, 2), (625, 'general budget', 1, 2), (21, 'general budget', 2, 2)
select * from `budgets` where `budgets`.`user_id` = 2 and `budgets`.`user_id` is not null order by `created_at` desc
---
            ],
        ];

        Budget::insert($defaultBudgetsData);

        return $user
            ->refresh()
            ->budgets()
            ->latest()
            ->get();