app/Services/Transaction/Synchronization/SynchronizationService.php

    public function countByUser(User $user): int
    {
        return Synchronization::whereUser($user)->count();
---
select count(*) as aggregate from `synchronizations` where `user_id` = 2

    public function getLatestSucceededByUser(User $user): ?Synchronization
    {
        return Synchronization::whereUser($user)
            ->where('status', Synchronization::SYNC_STATUS_SUCCEEDED)
            ->with('import')
            ->latest()
            ->limit(1)
            ->get()
            ->first();
---
select * from `synchronizations` where `user_id` = 2 and `status` = 2 order by `created_at` desc limit 1

    public function getEndUserAgreementsCountByUser(User $user): int
    {
        return EndUserAgreement::whereUser($user)->count();
---
select count(*) as aggregate from `nordigen_end_user_agreements` where `user_id` = 2