app/Services/Notification/NotificationService.php

select * from `notifications` where `user_id` = 2 order by `created_at` desc limit 5
---
    public function all(User $user, int $limit = 5): Collection
    {
        return Notification::whereUser($user)->latest()->limit($limit)->get();

select * from `notifications` where `user_id` = 2 and `type` = 4 order by `created_at` desc limit 4
---
    public function allEvents(User $user, int $limit = 5)
    {
        return Notification::whereUser($user)
            ->where('type', Notification::TYPE_EVENT)
            ->latest()
            ->limit($limit)
            ->get();