app/Services/HomePage/HomePageService.php

select * from `transactions` where `user_id` = 2 order by `transaction_date` desc limit 10
select * from `synchronizations` where `user_id` = 2 and `status` = 2 order by `created_at` desc limit 1
---
    public function getLatestTransactionsData(User $user): array
    {
        return [
            'agreement' => $this
                ->transactionSyncService
                ->getAgreements($user)
                ->first(),
            'transactions' => Transaction::whereUser($user)
                ->orderByTransactionDate()
                ->limit(10)
                ->get(),
            'last_synchronization' => Synchronization::whereUser($user)
                ->where('status', Synchronization::SYNC_STATUS_SUCCEEDED)
                ->with('import')
                ->latest()
                ->limit(1)
                ->get()
                ->first()