app/Http/Controllers/Web/Home/HomeController.php

    public function index(Request $request): View
    {
        $user = $request->user();
        $budgets = $this->budgetService->allWithConsumption($user);
        $currencyCode = $this->currencyService->resolveCalculationCurrency($user);
        $eventNotifications = $this->notificationService->allEvents($user, 4);
        $expendituresTodayTotal = $this->transactionQuerySet->getExpendituresTodayTotal($user);
        $expendituresThisWeekTotal = $this->transactionQuerySet->getExpendituresThisWeekTotal($user);
        $incomesTodayTotal = $this->transactionQuerySet->getIncomesTodayTotal($user);
        $incomesThisWeekTotal = $this->transactionQuerySet->getIncomesThisWeekTotal($user);

        return view(
            'home.index',
            [
                'currencyCode' => $currencyCode,
                'budgetsWithConsumption' => $budgets,
                'eventNotifications' => $eventNotifications,
                'transactionsData' => $this->homePageService->getLatestTransactionsData($user),
                'saldoData' => $this->saldoService->getByUser($user),
                'synchronizationsCount' => Synchronization::count(), // @todo
                'endUserAgreementCount' => EndUserAgreement::count(), // @todo,
---
select count(*) as aggregate from `synchronizations`
select count(*) as aggregate from `nordigen_end_user_agreements`