app/Services/Transaction/Report/ReportService.php

    public function getPeriodicReport(?string $rawMonth, mixed $userId): array
    {
        if ($rawMonth) {
            $carbon = Carbon::createFromFormat('Y-m', $rawMonth);
        } else {
            $carbon = now();
        }

        $cacheKey = $carbon->format('Y_m') . '_periodic_report_' . $userId;

        if (Cache::has($cacheKey)) {
            $data = Cache::get($cacheKey);

        } else {
            $user = User::findOrFail($userId);
---
select * from `users` where `users`.`id` = 2 limit 1