app/Services/Import/ImportSettingService.php

    public function all(User $user): Collection
    {
        return ImportSetting::whereUser($user)->latest()->get();
---
select * from `import_settings` where `user_id` = 2 order by `created_at` desc