app/Services/Import/ImportService.php

select count(*) as aggregate from `columns_mappings` where `user_id` = 2
---
    public function columnConfigurationForUserExist(User $user): bool
    {
        return ColumnsMapping::whereUser($user)->count() === 0