app/Services/Auth/Api/UserService.php

select * from `users` where (`email` = 'guest@example.com') limit 1
---
    public function login(array $data): array
    {
        $user = User::firstWhere(['email' => $data['email']]);