app/Services/Nordigen/NordigenService.php

    public function getAgreements(User $user): Collection
    {
        return EndUserAgreement::whereUser($user)->with('requisitions')->latest()->get();
---
select * from `nordigen_end_user_agreements` where `user_id` = 2 order by `created_at` desc